
## Terraform plan for environment: `dev`

**Commit:** 93f7b67116c1ce23c2790290ec5b666bfbd7d9df


**API version:** 5985b43dd8
**CLI version:** 5985b43dd8
**Selfserve version:** bc869e2dc1
**Internal version:** bc8ecf3b82

### Plan summary

`1 to add, 0 to change, 0 to destroy`

**🆕 Creates**

```tf
module.service.module.batch-liquibase.aws_batch_job_definition.this["liquibase"]
```


----

<details data-gh-workflow="dev-environment-plan"><summary>Show full plan</summary>

```tf


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.service.module.batch-liquibase.aws_batch_job_definition.this["liquibase"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = jsonencode(
            {
              + environment                  = [
                  + {
                      + name  = "DB_HOST"
                      + value = "olcsdb-rds.DEV.olcs.dev-dvsacloud.uk"
                    },
                  + {
                      + name  = "DB_NAME"
                      + value = "OLCS_RDS_OLCSDB"
                    },
                  + {
                      + name  = "DB_USER"
                      + value = "olcsapi"
                    },
                  + {
                      + name  = "DB_PORT"
                      + value = "3306"
                    },
                ]
              + executionRoleArn             = "arn:aws:iam::054614622558:role/vol-app-dev-api-service-20240418150301367500000003"
              + fargatePlatformConfiguration = {
                  + platformVersion = "LATEST"
                }
              + image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/liquibase:latest"
              + jobRoleArn                   = "arn:aws:iam::054614622558:role/vol-app-dev-api-service-20240418150301374200000005"
              + logConfiguration             = {
                  + logDriver = "awslogs"
                  + options   = {
                      + awslogs-group         = "/aws/batch/liquibase/dev"
                      + awslogs-region        = "eu-west-1"
                      + awslogs-stream-prefix = "vol-app-dev-liquibase"
                    }
                }
              + resourceRequirements         = [
                  + {
                      + type  = "VCPU"
                      + value = "1"
                    },
                  + {
                      + type  = "MEMORY"
                      + value = "2048"
                    },
                ]
              + runtimePlatform              = {
                  + cpuArchitecture       = "ARM64"
                  + operatingSystemFamily = "LINUX"
                }
              + secrets                      = [
                  + {
                      + name      = "DB_PASSWORD"
                      + valueFrom = "arn:aws:secretsmanager:eu-west-1:054614622558:secret:DEVAPPDEV-BASE-SM-APPLICATION-API:olcs_api_rds_password"
                    },
                ]
            }
        )
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-dev-liquibase"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "dev"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 300
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

</details>